/* 1) Напишите программу, где пользователь вводит любое целое положительное 
число. А программа суммирует все числа от 1 до введенного пользователем числа. */

// let num = (prompt ("Введите целое положительное число: "));
// let sum = 0;
// for (let i = 1; i <= num; i++) {
//     sum = sum + i;
// }
// console.log ("сумма всех чисел от 1 до", num, "равна", sum);


/* 2. Напишите цикл, который за 7 вызовов console.log выводит такой треугольник: */

for (let i = 1; i <= 7; i++) {
    console.log("#".repeat(i));
}

